package bg.tu_varna.sit.f24621690.commands.command;

/**
 * Основен интерфейс за всички команди в системата.
 */
public interface Command {

    /**
     * Стартира изпълнението на конкретната бизнес логика, капсулирана в командата.
     * <p>
     * Методът взаимодейства със Singleton инстанциите на {@link bg.tu_varna.sit.f24621690.models.Restaurant}
     * и/или {@link bg.tu_varna.sit.f24621690.models.Menu}, за да чете или модифицира състоянието на системата.
     * Всички проверки за валидност на данните се извършват тук.
     * </p>
     *
     * @return Текстово съобщение, описващо резултата от успешното изпълнение на операцията.
     * @throws Exception Ако възникне логическа грешка, която нарушава бизнес правилата
     * (напр. опит за добавяне на съществуващ елемент, липса на наличност и др.).
     */
    String execute() throws Exception;
}
